/*
找出下一個，二進位表示法之下， 具有相同數量的 1 的數字
例如 00100110 有三個 1
下一個數字是 00101001 也有三個 1

  char x, t, y, z;
  x = 38;           // 00100110
  t = x & -x;       // 00100110 & 11011010 → 00000010 找出最右邊的 1
  y = t + x;        // 00000010 + 00100110 → 00101000 設法讓最右邊的 1 都變成0
  z = y ^ x;        // 00101000 ^ 00100110 → 00001110 找出 x y 不同的地方
  z = (z >> 2) / t; // 00000011 / 00000010 → 00000001 得到需要補上的 1s
  x = y | z;        // 00101000 | 00000001 → 00101001 補上 1s
*/

#include <stdio.h>

int main(void)
{

	int N, k, i, j, lim;
	int x, t, y, z;
	int num[16];

	scanf("%d%d", &N, &k);
	for (i=0; i<N; i++) {
		scanf("%d", &num[i]);
	}

	lim = 1<<N;

	x = 0;
	x = ~(~x << k);

	for (; x<lim; ) {
		for (j=N-1; j>=0; j--)  {
			if ( (x & (1<<j))!= 0 ) {
				printf("%d ", num[j]);
			}
		}
		t = x & -x; 
		y =  t + x; 
		z = y ^ x; 
		z = (z>>2)/t;  
		x = y | z; 
		
		printf("\n");
	}

return 0;
}
